[Survived] BooleanLiteral
src/lib/errorTracking.ts:26:32
 
 // Configuration
 const ERROR_API_ENDPOINT = '/api/v1/errors/report';
-const ENABLE_CONSOLE_LOGGING = true;
+const ENABLE_CONSOLE_LOGGING = false;
 const BATCH_SIZE = 10;
 const FLUSH_INTERVAL = 30000; // 30 seconds

[Survived] LogicalOperator
src/lib/errorTracking.ts:40:14
 export function initErrorTracking(): void {
   // Global error handler
   window.onerror = (message, source, lineno, colno, error) => {
-    logError(error || new Error(String(message)), {
+    logError(error && new Error(String(message)), {
       metadata: { source, lineno, colno }
     });

[Survived] ConditionalExpression
src/lib/errorTracking.ts:40:14
 export function initErrorTracking(): void {
   // Global error handler
   window.onerror = (message, source, lineno, colno, error) => {
-    logError(error || new Error(String(message)), {
+    logError(true, {
       metadata: { source, lineno, colno }
     });

[Survived] ObjectLiteral
src/lib/errorTracking.ts:41:17
   // Global error handler
   window.onerror = (message, source, lineno, colno, error) => {
     logError(error || new Error(String(message)), {
-      metadata: { source, lineno, colno }
+      metadata: {}
     });
     return false;

[Survived] ObjectLiteral
src/lib/errorTracking.ts:67:31
   context: Partial<ErrorContext> = {},
   severity: ErrorReport['severity'] = 'medium'
 ): void {
-  const report: ErrorReport = {
-    message: error.message,
-    stack: error.stack,
-    severity,
-    context: {
-      url: window.location.href,
-      userAgent: navigator.userAgent,
-      timestamp: new Date().toISOString(),
-      sessionId: getSessionId(),
-      userId: getUserId(),
-      ...context,
-    },
-  };
+  const report: ErrorReport = {};
 
   // Console logging in development

[Survived] ObjectLiteral
src/lib/errorTracking.ts:71:14
     message: error.message,
     stack: error.stack,
     severity,
-    context: {
-      url: window.location.href,
-      userAgent: navigator.userAgent,
-      timestamp: new Date().toISOString(),
-      sessionId: getSessionId(),
-      userId: getUserId(),
-      ...context,
-    },
+    context: {},
   };
 

[Survived] ConditionalExpression
src/lib/errorTracking.ts:82:7
   };
 
   // Console logging in development
-  if (ENABLE_CONSOLE_LOGGING) {
+  if (true) {
     console.error('[ErrorTracking]', report.message, {
       stack: report.stack,

[Survived] ConditionalExpression
src/lib/errorTracking.ts:82:7
   };
 
   // Console logging in development
-  if (ENABLE_CONSOLE_LOGGING) {
+  if (false) {
     console.error('[ErrorTracking]', report.message, {
       stack: report.stack,

[Survived] ObjectLiteral
src/lib/errorTracking.ts:83:54
 
   // Console logging in development
   if (ENABLE_CONSOLE_LOGGING) {
-    console.error('[ErrorTracking]', report.message, {
-      stack: report.stack,
-      context: report.context,
-      severity: report.severity,
-    });
+    console.error('[ErrorTracking]', report.message, {});
   }
 

[Survived] LogicalOperator
src/lib/errorTracking.ts:94:7
   errorQueue.push(report);
 
   // Flush if queue is full or critical
-  if (errorQueue.length >= BATCH_SIZE || severity === 'critical') {
+  if (errorQueue.length >= BATCH_SIZE && severity === 'critical') {
     flushErrors();
   }

[Survived] ConditionalExpression
src/lib/errorTracking.ts:94:7
   errorQueue.push(report);
 
   // Flush if queue is full or critical
-  if (errorQueue.length >= BATCH_SIZE || severity === 'critical') {
+  if (false) {
     flushErrors();
   }

[Survived] ObjectLiteral
src/lib/errorTracking.ts:106:19
   error: Error,
   errorInfo: { componentStack?: string }
 ): void {
-  logError(error, {
-    componentStack: errorInfo.componentStack,
-    metadata: { source: 'ErrorBoundary' },
-  }, 'high');
+  logError(error, {}, 'high');
 }
 

[Survived] ConditionalExpression
src/lib/errorTracking.ts:116:7
  * Flush error queue to backend
  */
 async function flushErrors(): Promise<void> {
-  if (errorQueue.length === 0) {return;}
+  if (true) {return;}
 
   const errors = [...errorQueue];

[Survived] EqualityOperator
src/lib/errorTracking.ts:116:7
  * Flush error queue to backend
  */
 async function flushErrors(): Promise<void> {
-  if (errorQueue.length === 0) {return;}
+  if (errorQueue.length !== 0) {return;}
 
   const errors = [...errorQueue];

[Survived] ArrayDeclaration
src/lib/errorTracking.ts:118:18
 async function flushErrors(): Promise<void> {
   if (errorQueue.length === 0) {return;}
 
-  const errors = [...errorQueue];
+  const errors = [];
   errorQueue = [];
 

[Survived] ArrayDeclaration
src/lib/errorTracking.ts:119:16
   if (errorQueue.length === 0) {return;}
 
   const errors = [...errorQueue];
-  errorQueue = [];
+  errorQueue = ["Stryker was here"];
 
   try {

[Survived] ObjectLiteral
src/lib/errorTracking.ts:123:45
 
   try {
     const token = localStorage.getItem('accessToken');
-    const headers: Record<string, string> = {
-      'Content-Type': 'application/json',
-    };
+    const headers: Record<string, string> = {};
     if (token) {
       headers['Authorization'] = `Bearer ${token}`;

[Survived] ConditionalExpression
src/lib/errorTracking.ts:126:9
     const headers: Record<string, string> = {
       'Content-Type': 'application/json',
     };
-    if (token) {
+    if (false) {
       headers['Authorization'] = `Bearer ${token}`;
     }

[Survived] ConditionalExpression
src/lib/errorTracking.ts:126:9
     const headers: Record<string, string> = {
       'Content-Type': 'application/json',
     };
-    if (token) {
+    if (true) {
       headers['Authorization'] = `Bearer ${token}`;
     }

[Survived] ObjectLiteral
src/lib/errorTracking.ts:130:54
       headers['Authorization'] = `Bearer ${token}`;
     }
 
-    const response = await fetch(ERROR_API_ENDPOINT, {
-      method: 'POST',
-      headers,
-      body: JSON.stringify({ errors }),
-    });
+    const response = await fetch(ERROR_API_ENDPOINT, {});
 
     if (!response.ok) {

[Survived] ArrayDeclaration
src/lib/errorTracking.ts:138:20
 
     if (!response.ok) {
       // Put errors back in queue
-      errorQueue = [...errors, ...errorQueue];
+      errorQueue = [];
       console.warn('[ErrorTracking] Failed to send errors, will retry');
     } else {

[Survived] BooleanLiteral
src/lib/errorTracking.ts:155:7
  */
 function getSessionId(): string {
   let sessionId = sessionStorage.getItem('datacendia_session_id');
-  if (!sessionId) {
+  if (sessionId) {
     sessionId = `session_${Date.now()}_${Math.random().toString(36).substr(2, 9)}`;
     sessionStorage.setItem('datacendia_session_id', sessionId);

[Survived] ConditionalExpression
src/lib/errorTracking.ts:155:7
  */
 function getSessionId(): string {
   let sessionId = sessionStorage.getItem('datacendia_session_id');
-  if (!sessionId) {
+  if (true) {
     sessionId = `session_${Date.now()}_${Math.random().toString(36).substr(2, 9)}`;
     sessionStorage.setItem('datacendia_session_id', sessionId);

[Survived] MethodExpression
src/lib/errorTracking.ts:156:42
 function getSessionId(): string {
   let sessionId = sessionStorage.getItem('datacendia_session_id');
   if (!sessionId) {
-    sessionId = `session_${Date.now()}_${Math.random().toString(36).substr(2, 9)}`;
+    sessionId = `session_${Date.now()}_${Math.random().toString(36)}`;
     sessionStorage.setItem('datacendia_session_id', sessionId);
   }

[Survived] ConditionalExpression
src/lib/errorTracking.ts:168:9
 function getUserId(): string | undefined {
   try {
     const token = localStorage.getItem('accessToken');
-    if (token) {
+    if (false) {
       // Decode JWT to get user ID (basic decode, not verification)
       const payload = JSON.parse(atob(token.split('.')[1]));

[Survived] ConditionalExpression
src/lib/errorTracking.ts:168:9
 function getUserId(): string | undefined {
   try {
     const token = localStorage.getItem('accessToken');
-    if (token) {
+    if (true) {
       // Decode JWT to get user ID (basic decode, not verification)
       const payload = JSON.parse(atob(token.split('.')[1]));

[Survived] ConditionalExpression
src/lib/errorTracking.ts:171:14
     if (token) {
       // Decode JWT to get user ID (basic decode, not verification)
       const payload = JSON.parse(atob(token.split('.')[1]));
-      return payload.sub || payload.userId;
+      return true;
     }
   } catch {

[Survived] LogicalOperator
src/lib/errorTracking.ts:171:14
     if (token) {
       // Decode JWT to get user ID (basic decode, not verification)
       const payload = JSON.parse(atob(token.split('.')[1]));
-      return payload.sub || payload.userId;
+      return payload.sub && payload.userId;
     }
   } catch {

[Survived] ConditionalExpression
src/lib/errorTracking.ts:183:7
  * Cleanup on unmount
  */
 export function cleanupErrorTracking(): void {
-  if (flushTimer) {
+  if (false) {
     clearInterval(flushTimer);
     flushTimer = null;

[Survived] ConditionalExpression
src/lib/errorTracking.ts:183:7
  * Cleanup on unmount
  */
 export function cleanupErrorTracking(): void {
-  if (flushTimer) {
+  if (true) {
     clearInterval(flushTimer);
     flushTimer = null;

[Survived] ObjectLiteral
src/lib/errorTracking.ts:191:16
 }
 
 // Export default instance
-export default {
-  init: initErrorTracking,
-  log: logError,
-  logComponent: logComponentError,
-  cleanup: cleanupErrorTracking,
-};
+export default {};
 
