[Survived] ObjectLiteral
src/hooks/usePremiumFeatures.ts:17:51
 } from '../data/premiumFeatures';
 
 // Agent ID to Premium Feature mapping
-const AGENT_FEATURE_MAP: Record<string, string> = {
-  // Audit Excellence Pack
-  'agent-ext-auditor': 'audit-excellence',
-  'agent-int-auditor': 'audit-excellence',
-  // Healthcare Industry Pack
-  'agent-cmio': 'healthcare-pack',
-  'agent-pso': 'healthcare-pack',
-  'agent-hco': 'healthcare-pack',
-  'agent-cod': 'healthcare-pack',
-  // Finance Industry Pack
-  'agent-quant': 'finance-pack',
-  'agent-pm': 'finance-pack',
-  'agent-cro-finance': 'finance-pack',
-  'agent-treasury': 'finance-pack',
-  // Legal Industry Pack
-  'agent-contracts': 'legal-pack',
-  'agent-ip': 'legal-pack',
-  'agent-litigation': 'legal-pack',
-  'agent-regulatory': 'legal-pack',
-};
+const AGENT_FEATURE_MAP: Record<string, string> = {};
 
 interface PremiumState {

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:48:9
 export function usePremiumFeatures() {
   const [state, setState] = useState<PremiumState>(() => {
     const saved = localStorage.getItem(STORAGE_KEY);
-    if (saved) {
+    if (false) {
       try {
         return JSON.parse(saved);

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:48:9
 export function usePremiumFeatures() {
   const [state, setState] = useState<PremiumState>(() => {
     const saved = localStorage.getItem(STORAGE_KEY);
-    if (saved) {
+    if (true) {
       try {
         return JSON.parse(saved);

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:52:59
       try {
         return JSON.parse(saved);
       } catch {
-        return { purchasedFeatures: [], purchasedBundles: [] };
+        return { purchasedFeatures: [], purchasedBundles: ["Stryker was here"] };
       }
     }

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:55:33
         return { purchasedFeatures: [], purchasedBundles: [] };
       }
     }
-    return { purchasedFeatures: [], purchasedBundles: [] };
+    return { purchasedFeatures: ["Stryker was here"], purchasedBundles: [] };
   });
 

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:61:6
   // Save to localStorage on change
   useEffect(() => {
     localStorage.setItem(STORAGE_KEY, JSON.stringify(state));
-  }, [state]);
+  }, []);
 
   // Check if a specific feature is unlocked

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:66:9
   // Check if a specific feature is unlocked
   const hasFeature = useCallback((featureId: string): boolean => {
     // Direct feature purchase
-    if (state.purchasedFeatures.includes(featureId)) {
+    if (false) {
       return true;
     }

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:66:9
   // Check if a specific feature is unlocked
   const hasFeature = useCallback((featureId: string): boolean => {
     // Direct feature purchase
-    if (state.purchasedFeatures.includes(featureId)) {
+    if (true) {
       return true;
     }

[Survived] BooleanLiteral
src/hooks/usePremiumFeatures.ts:67:14
   const hasFeature = useCallback((featureId: string): boolean => {
     // Direct feature purchase
     if (state.purchasedFeatures.includes(featureId)) {
-      return true;
+      return false;
     }
     // Check if any purchased bundle includes this feature

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:72:11
     // Check if any purchased bundle includes this feature
     for (const bundleId of state.purchasedBundles) {
       const bundle = getBundleById(bundleId);
-      if (bundle?.includedFeatures.includes(featureId)) {
+      if (false) {
         return true;
       }

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:72:11
     // Check if any purchased bundle includes this feature
     for (const bundleId of state.purchasedBundles) {
       const bundle = getBundleById(bundleId);
-      if (bundle?.includedFeatures.includes(featureId)) {
+      if (true) {
         return true;
       }

[Survived] BooleanLiteral
src/hooks/usePremiumFeatures.ts:73:16
     for (const bundleId of state.purchasedBundles) {
       const bundle = getBundleById(bundleId);
       if (bundle?.includedFeatures.includes(featureId)) {
-        return true;
+        return false;
       }
     }

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:77:6
       }
     }
     return false;
-  }, [state]);
+  }, []);
 
   // Check if a premium agent is accessible

[Survived] BooleanLiteral
src/hooks/usePremiumFeatures.ts:82:9
   // Check if a premium agent is accessible
   const hasAgentAccess = useCallback((agentId: string): boolean => {
     const requiredFeature = AGENT_FEATURE_MAP[agentId];
-    if (!requiredFeature) {
+    if (requiredFeature) {
       // Not a premium agent, or no mapping exists
       return true;

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:82:9
   // Check if a premium agent is accessible
   const hasAgentAccess = useCallback((agentId: string): boolean => {
     const requiredFeature = AGENT_FEATURE_MAP[agentId];
-    if (!requiredFeature) {
+    if (false) {
       // Not a premium agent, or no mapping exists
       return true;

[Survived] BooleanLiteral
src/hooks/usePremiumFeatures.ts:84:14
     const requiredFeature = AGENT_FEATURE_MAP[agentId];
     if (!requiredFeature) {
       // Not a premium agent, or no mapping exists
-      return true;
+      return false;
     }
     return hasFeature(requiredFeature);

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:87:6
       return true;
     }
     return hasFeature(requiredFeature);
-  }, [hasFeature]);
+  }, []);
 
   // Get the required feature for an agent

[Survived] BooleanLiteral
src/hooks/usePremiumFeatures.ts:92:9
   // Get the required feature for an agent
   const getAgentRequiredFeature = useCallback((agentId: string): PremiumFeature | undefined => {
     const featureId = AGENT_FEATURE_MAP[agentId];
-    if (!featureId) {return undefined;}
+    if (featureId) {return undefined;}
     return getFeatureById(featureId);
   }, []);

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:92:9
   // Get the required feature for an agent
   const getAgentRequiredFeature = useCallback((agentId: string): PremiumFeature | undefined => {
     const featureId = AGENT_FEATURE_MAP[agentId];
-    if (!featureId) {return undefined;}
+    if (true) {return undefined;}
     return getFeatureById(featureId);
   }, []);

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:94:6
     const featureId = AGENT_FEATURE_MAP[agentId];
     if (!featureId) {return undefined;}
     return getFeatureById(featureId);
-  }, []);
+  }, ["Stryker was here"]);
 
   // Purchase a feature

[Survived] ArrowFunction
src/hooks/usePremiumFeatures.ts:98:14
 
   // Purchase a feature
   const purchaseFeature = useCallback((featureId: string) => {
-    setState(prev => ({
-      ...prev,
-      purchasedFeatures: [...new Set([...prev.purchasedFeatures, featureId])]
-    }));
+    setState(() => undefined);
   }, []);
 

[Survived] ObjectLiteral
src/hooks/usePremiumFeatures.ts:98:23
 
   // Purchase a feature
   const purchaseFeature = useCallback((featureId: string) => {
-    setState(prev => ({
-      ...prev,
-      purchasedFeatures: [...new Set([...prev.purchasedFeatures, featureId])]
-    }));
+    setState(prev => ({}));
   }, []);
 

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:100:38
   const purchaseFeature = useCallback((featureId: string) => {
     setState(prev => ({
       ...prev,
-      purchasedFeatures: [...new Set([...prev.purchasedFeatures, featureId])]
+      purchasedFeatures: [...new Set([])]
     }));
   }, []);

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:107:9
   // Purchase a bundle
   const purchaseBundle = useCallback((bundleId: string) => {
     const bundle = getBundleById(bundleId);
-    if (bundle) {
+    if (false) {
       setState(prev => ({
         purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:107:9
   // Purchase a bundle
   const purchaseBundle = useCallback((bundleId: string) => {
     const bundle = getBundleById(bundleId);
-    if (bundle) {
+    if (true) {
       setState(prev => ({
         purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],

[Survived] ArrowFunction
src/hooks/usePremiumFeatures.ts:108:16
   const purchaseBundle = useCallback((bundleId: string) => {
     const bundle = getBundleById(bundleId);
     if (bundle) {
-      setState(prev => ({
-        purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],
-        purchasedFeatures: [...new Set([...prev.purchasedFeatures, ...bundle.includedFeatures])]
-      }));
+      setState(() => undefined);
     }
   }, []);

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:109:39
     const bundle = getBundleById(bundleId);
     if (bundle) {
       setState(prev => ({
-        purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],
+        purchasedBundles: [...new Set([])],
         purchasedFeatures: [...new Set([...prev.purchasedFeatures, ...bundle.includedFeatures])]
       }));

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:109:27
     const bundle = getBundleById(bundleId);
     if (bundle) {
       setState(prev => ({
-        purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],
+        purchasedBundles: [],
         purchasedFeatures: [...new Set([...prev.purchasedFeatures, ...bundle.includedFeatures])]
       }));

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:110:40
     if (bundle) {
       setState(prev => ({
         purchasedBundles: [...new Set([...prev.purchasedBundles, bundleId])],
-        purchasedFeatures: [...new Set([...prev.purchasedFeatures, ...bundle.includedFeatures])]
+        purchasedFeatures: [...new Set([])]
       }));
     }

[Survived] ArrowFunction
src/hooks/usePremiumFeatures.ts:120:40
     const unlocked = new Set(state.purchasedFeatures);
     for (const bundleId of state.purchasedBundles) {
       const bundle = getBundleById(bundleId);
-      bundle?.includedFeatures.forEach(f => unlocked.add(f));
+      bundle?.includedFeatures.forEach(() => undefined);
     }
     return Array.from(unlocked);

[Survived] OptionalChaining
src/hooks/usePremiumFeatures.ts:120:7
     const unlocked = new Set(state.purchasedFeatures);
     for (const bundleId of state.purchasedBundles) {
       const bundle = getBundleById(bundleId);
-      bundle?.includedFeatures.forEach(f => unlocked.add(f));
+      bundle.includedFeatures.forEach(f => unlocked.add(f));
     }
     return Array.from(unlocked);

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:123:6
       bundle?.includedFeatures.forEach(f => unlocked.add(f));
     }
     return Array.from(unlocked);
-  }, [state]);
+  }, []);
 
   // Check if Agent Builder is unlocked (for custom agents)

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:133:6
   // Check if API Access is unlocked
   const hasApiAccess = useCallback((): boolean => {
     return hasFeature('api-access');
-  }, [hasFeature]);
+  }, []);
 
   // Check if Team Collaboration is unlocked

[Survived] LogicalOperator
src/hooks/usePremiumFeatures.ts:137:12
 
   // Check if Team Collaboration is unlocked
   const hasTeamFeatures = useCallback((): boolean => {
-    return hasFeature('team-collaboration') || hasFeature('unlimited-team');
+    return hasFeature('team-collaboration') && hasFeature('unlimited-team');
   }, [hasFeature]);
 

[Survived] ConditionalExpression
src/hooks/usePremiumFeatures.ts:137:12
 
   // Check if Team Collaboration is unlocked
   const hasTeamFeatures = useCallback((): boolean => {
-    return hasFeature('team-collaboration') || hasFeature('unlimited-team');
+    return true;
   }, [hasFeature]);
 

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:142:57
 
   // Reset all purchases (for testing)
   const resetPurchases = useCallback(() => {
-    setState({ purchasedFeatures: [], purchasedBundles: [] });
+    setState({ purchasedFeatures: [], purchasedBundles: ["Stryker was here"] });
   }, []);
 

[Survived] ArrayDeclaration
src/hooks/usePremiumFeatures.ts:143:6
   // Reset all purchases (for testing)
   const resetPurchases = useCallback(() => {
     setState({ purchasedFeatures: [], purchasedBundles: [] });
-  }, []);
+  }, ["Stryker was here"]);
 
   // Unlock all features (demo mode)

[Survived] ArrowFunction
src/hooks/usePremiumFeatures.ts:148:47
   // Unlock all features (demo mode)
   const unlockAll = useCallback(() => {
     setState({
-      purchasedFeatures: PREMIUM_FEATURES.map(f => f.id),
+      purchasedFeatures: PREMIUM_FEATURES.map(() => undefined),
       purchasedBundles: PREMIUM_BUNDLES.map(b => b.id),
     });

[Survived] ArrowFunction
src/hooks/usePremiumFeatures.ts:149:45
   const unlockAll = useCallback(() => {
     setState({
       purchasedFeatures: PREMIUM_FEATURES.map(f => f.id),
-      purchasedBundles: PREMIUM_BUNDLES.map(b => b.id),
+      purchasedBundles: PREMIUM_BUNDLES.map(() => undefined),
     });
   }, []);
