[Survived] ConditionalExpression
src/lib/featureFlags.ts:41:17
 export async function isFeatureEnabled(flag: FeatureFlag): Promise<boolean> {
   // Check cache first
   const cached = flagCache.get(flag);
-  if (cached && Date.now() - cached.timestamp < CACHE_TTL) {
+  if (cached && true) {
     return cached.value;
   }

[Survived] ArithmeticOperator
src/lib/featureFlags.ts:41:17
 export async function isFeatureEnabled(flag: FeatureFlag): Promise<boolean> {
   // Check cache first
   const cached = flagCache.get(flag);
-  if (cached && Date.now() - cached.timestamp < CACHE_TTL) {
+  if (cached && Date.now() + cached.timestamp < CACHE_TTL) {
     return cached.value;
   }

[Survived] ObjectLiteral
src/lib/featureFlags.ts:46:76
   }
 
   try {
-    const response = await fetch(`${UNLEASH_URL}/client/features/${flag}`, {
-      headers: {
-        'Authorization': UNLEASH_TOKEN,
-        'Content-Type': 'application/json',
-      },
-    });
+    const response = await fetch(`${UNLEASH_URL}/client/features/${flag}`, {});
 
     if (!response.ok) {

[Survived] BooleanLiteral
src/lib/featureFlags.ts:55:14
 
     if (!response.ok) {
       console.warn(`[FeatureFlags] Failed to fetch flag ${flag}, using default`);
-      return false;
+      return true;
     }
 

[Survived] BooleanLiteral
src/lib/featureFlags.ts:59:37
     }
 
     const data = await response.json();
-    const enabled = data.enabled ?? false;
+    const enabled = data.enabled ?? true;
 
     // Update cache

[Survived] LogicalOperator
src/lib/featureFlags.ts:59:21
     }
 
     const data = await response.json();
-    const enabled = data.enabled ?? false;
+    const enabled = data.enabled && false;
 
     // Update cache

[Survived] BooleanLiteral
src/lib/featureFlags.ts:67:12
     return enabled;
   } catch (error) {
     console.warn(`[FeatureFlags] Error fetching flag ${flag}:`, error);
-    return false;
+    return true;
   }
 }

[Survived] ObjectLiteral
src/lib/featureFlags.ts:78:68
   const flags: Record<string, boolean> = {};
 
   try {
-    const response = await fetch(`${UNLEASH_URL}/client/features`, {
-      headers: {
-        'Authorization': UNLEASH_TOKEN,
-        'Content-Type': 'application/json',
-      },
-    });
+    const response = await fetch(`${UNLEASH_URL}/client/features`, {});
 
     if (response.ok) {

[Survived] ConditionalExpression
src/lib/featureFlags.ts:87:29
 
     if (response.ok) {
       const data = await response.json();
-      for (const feature of data.features || []) {
+      for (const feature of false) {
         flags[feature.name] = feature.enabled ?? false;
         flagCache.set(feature.name, { value: feature.enabled, timestamp: Date.now() });

[Survived] LogicalOperator
src/lib/featureFlags.ts:87:29
 
     if (response.ok) {
       const data = await response.json();
-      for (const feature of data.features || []) {
+      for (const feature of data.features && []) {
         flags[feature.name] = feature.enabled ?? false;
         flagCache.set(feature.name, { value: feature.enabled, timestamp: Date.now() });

[Survived] BooleanLiteral
src/lib/featureFlags.ts:88:50
     if (response.ok) {
       const data = await response.json();
       for (const feature of data.features || []) {
-        flags[feature.name] = feature.enabled ?? false;
+        flags[feature.name] = feature.enabled ?? true;
         flagCache.set(feature.name, { value: feature.enabled, timestamp: Date.now() });
       }

[Survived] LogicalOperator
src/lib/featureFlags.ts:88:31
     if (response.ok) {
       const data = await response.json();
       for (const feature of data.features || []) {
-        flags[feature.name] = feature.enabled ?? false;
+        flags[feature.name] = feature.enabled && false;
         flagCache.set(feature.name, { value: feature.enabled, timestamp: Date.now() });
       }

[Survived] BooleanLiteral
src/lib/featureFlags.ts:108:10
 export function useFeatureFlag(flag: FeatureFlag): boolean {
   // For now, return true by default - in production, this would use React state
   // and the async isFeatureEnabled function
-  return true;
+  return false;
 }
 
