[Survived] ObjectLiteral
src/lib/sovereignApi.ts:82:73
     endTime: Date,
     granularity: 'minute' | 'hour' | 'day' = 'hour'
   ): Promise<any[]> {
-    const response = await fetch(`${SOVEREIGN_API_BASE}/druid/metrics`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ metric, startTime, endTime, granularity }),
-    });
+    const response = await fetch(`${SOVEREIGN_API_BASE}/druid/metrics`, {});
     const data = await response.json();
     return data.success ? data.data : [];

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:84:16
   ): Promise<any[]> {
     const response = await fetch(`${SOVEREIGN_API_BASE}/druid/metrics`, {
       method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
+      headers: {},
       body: JSON.stringify({ metric, startTime, endTime, granularity }),
     });

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:98:28
     const response = await fetch(`${SOVEREIGN_API_BASE}/druid/ingest`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ datasource, events }),
+      body: JSON.stringify({}),
     });
     const data = await response.json();

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:133:27
     metadata?: Record<string, string>,
     bucket = 'cendia-documents'
   ): Promise<{ url: string; etag: string } | null> {
-    const base64Content = typeof content === 'string' 
+    const base64Content = true 
       ? btoa(content) 
       : btoa(String.fromCharCode(...new Uint8Array(content)));

[Survived] EqualityOperator
src/lib/sovereignApi.ts:133:27
     metadata?: Record<string, string>,
     bucket = 'cendia-documents'
   ): Promise<{ url: string; etag: string } | null> {
-    const base64Content = typeof content === 'string' 
+    const base64Content = typeof content !== 'string' 
       ? btoa(content) 
       : btoa(String.fromCharCode(...new Uint8Array(content)));

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:152:11
   async downloadDocument(bucket: string, fileName: string): Promise<Blob | null> {
     try {
       const response = await fetch(`${SOVEREIGN_API_BASE}/storage/download/${bucket}/${fileName}`);
-      if (!response.ok) return null;
+      if (true) return null;
       return await response.blob();
     } catch {

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:152:11
   async downloadDocument(bucket: string, fileName: string): Promise<Blob | null> {
     try {
       const response = await fetch(`${SOVEREIGN_API_BASE}/storage/download/${bucket}/${fileName}`);
-      if (!response.ok) return null;
+      if (false) return null;
       return await response.blob();
     } catch {

[Survived] ArrayDeclaration
src/lib/sovereignApi.ts:168:39
       : `${SOVEREIGN_API_BASE}/storage/list/${bucket}`;
     const response = await fetch(url);
     const data = await response.json();
-    return data.success ? data.data : [];
+    return data.success ? data.data : ["Stryker was here"];
   },
 

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:228:28
     const response = await fetch(`${SOVEREIGN_API_BASE}/vector/search`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ query, limit, threshold }),
+      body: JSON.stringify({}),
     });
     const data = await response.json();

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:245:75
     confidence: number;
     participants: string[];
   }): Promise<boolean> {
-    const response = await fetch(`${SOVEREIGN_API_BASE}/vector/decision`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify(decision),
-    });
+    const response = await fetch(`${SOVEREIGN_API_BASE}/vector/decision`, {});
     const data = await response.json();
     return data.success;

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:328:78
     context?: Record<string, any>;
     priority?: 'critical' | 'high' | 'normal' | 'low';
   }): Promise<string | null> {
-    const response = await fetch(`${SOVEREIGN_API_BASE}/queue/deliberation`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify(deliberation),
-    });
+    const response = await fetch(`${SOVEREIGN_API_BASE}/queue/deliberation`, {});
     const data = await response.json();
     return data.success ? data.jobId : null;

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:407:76
     end: Date,
     step = '1m'
   ): Promise<any[]> {
-    const response = await fetch(`${SOVEREIGN_API_BASE}/prometheus/query`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({
-        query,
-        start: Math.floor(start.getTime() / 1000),
-        end: Math.floor(end.getTime() / 1000),
-        step,
-      }),
-    });
+    const response = await fetch(`${SOVEREIGN_API_BASE}/prometheus/query`, {});
     const data = await response.json();
     return data.success ? data.data?.result || [] : [];

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:410:28
     const response = await fetch(`${SOVEREIGN_API_BASE}/prometheus/query`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({
-        query,
-        start: Math.floor(start.getTime() / 1000),
-        end: Math.floor(end.getTime() / 1000),
-        step,
-      }),
+      body: JSON.stringify({}),
     });
     const data = await response.json();

[Survived] ArithmeticOperator
src/lib/sovereignApi.ts:412:27
       headers: { 'Content-Type': 'application/json' },
       body: JSON.stringify({
         query,
-        start: Math.floor(start.getTime() / 1000),
+        start: Math.floor(start.getTime() * 1000),
         end: Math.floor(end.getTime() / 1000),
         step,

[Survived] ArithmeticOperator
src/lib/sovereignApi.ts:413:25
       body: JSON.stringify({
         query,
         start: Math.floor(start.getTime() / 1000),
-        end: Math.floor(end.getTime() / 1000),
+        end: Math.floor(end.getTime() * 1000),
         step,
       }),

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:418:27
       }),
     });
     const data = await response.json();
-    return data.success ? data.data?.result || [] : [];
+    return data.success ? false : [];
   },
 

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:418:27
       }),
     });
     const data = await response.json();
-    return data.success ? data.data?.result || [] : [];
+    return data.success ? true : [];
   },
 

[Survived] OptionalChaining
src/lib/sovereignApi.ts:427:25
   async getCurrentValue(metricName: string): Promise<number | null> {
     const response = await fetch(`${SOVEREIGN_API_BASE}/prometheus/metric/${encodeURIComponent(metricName)}`);
     const data = await response.json();
-    if (data.success && data.data?.result?.[0]?.value) {
+    if (data.success && data.data.result?.[0]?.value) {
       return parseFloat(data.data.result[0].value[1]);
     }

[Survived] LogicalOperator
src/lib/sovereignApi.ts:427:9
   async getCurrentValue(metricName: string): Promise<number | null> {
     const response = await fetch(`${SOVEREIGN_API_BASE}/prometheus/metric/${encodeURIComponent(metricName)}`);
     const data = await response.json();
-    if (data.success && data.data?.result?.[0]?.value) {
+    if (data.success || data.data?.result?.[0]?.value) {
       return parseFloat(data.data.result[0].value[1]);
     }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:468:28
     const response = await fetch(`${SOVEREIGN_API_BASE}/n8n/trigger/${workflowId}`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify(payload || {}),
+      body: JSON.stringify(false),
     });
     const data = await response.json();

[Survived] LogicalOperator
src/lib/sovereignApi.ts:468:28
     const response = await fetch(`${SOVEREIGN_API_BASE}/n8n/trigger/${workflowId}`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify(payload || {}),
+      body: JSON.stringify(payload && {}),
     });
     const data = await response.json();

[Survived] LogicalOperator
src/lib/sovereignApi.ts:508:12
   async isEnabled(featureName: string): Promise<boolean> {
     const response = await fetch(`${SOVEREIGN_API_BASE}/unleash/feature/${featureName}`);
     const data = await response.json();
-    return data.enabled ?? false;
+    return data.enabled && false;
   },
 

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:508:28
   async isEnabled(featureName: string): Promise<boolean> {
     const response = await fetch(`${SOVEREIGN_API_BASE}/unleash/feature/${featureName}`);
     const data = await response.json();
-    return data.enabled ?? false;
+    return data.enabled ?? true;
   },
 

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:547:77
    * Check if user has permission (Casbin policy check)
    */
   async checkPermission(resource: string, action: string): Promise<boolean> {
-    const response = await fetch(`${ENTERPRISE_API_BASE}/check-permission`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ resource, action }),
-    });
+    const response = await fetch(`${ENTERPRISE_API_BASE}/check-permission`, {});
     const data = await response.json();
     return data.allowed ?? false;

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:553:28
       body: JSON.stringify({ resource, action }),
     });
     const data = await response.json();
-    return data.allowed ?? false;
+    return data.allowed ?? true;
   },
 

[Survived] LogicalOperator
src/lib/sovereignApi.ts:553:12
       body: JSON.stringify({ resource, action }),
     });
     const data = await response.json();
-    return data.allowed ?? false;
+    return data.allowed && false;
   },
 

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:566:28
     const response = await fetch(`${ENTERPRISE_API_BASE}/policies/can-approve`, {
       method: 'POST',
       headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ decisionType, existingApprovers }),
+      body: JSON.stringify({}),
     });
     const data = await response.json();

[Survived] LogicalOperator
src/lib/sovereignApi.ts:569:23
       body: JSON.stringify({ decisionType, existingApprovers }),
     });
     const data = await response.json();
-    return { allowed: data.allowed ?? false, reason: data.reason ?? '' };
+    return { allowed: data.allowed && false, reason: data.reason ?? '' };
   },
 

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:569:39
       body: JSON.stringify({ decisionType, existingApprovers }),
     });
     const data = await response.json();
-    return { allowed: data.allowed ?? false, reason: data.reason ?? '' };
+    return { allowed: data.allowed ?? true, reason: data.reason ?? '' };
   },
 

[Survived] LogicalOperator
src/lib/sovereignApi.ts:582:54
       body: JSON.stringify({ decisionType }),
     });
     const data = await response.json();
-    return { allowed: data.allowed ?? false, reason: data.reason ?? '' };
+    return { allowed: data.allowed ?? false, reason: data.reason && '' };
   },
 

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:592:14
     content: string, // base64 encoded
     mimeType: string,
     fileName?: string,
-    useOCR = false
+    useOCR = true
   ): Promise<{ text: string; metadata: any; wordCount: number } | null> {
     const response = await fetch(`${ENTERPRISE_API_BASE}/documents/extract`, {

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:610:89
     fileName?: string,
     useOCR = false
   ): Promise<{ text: string; metadata: any; wordCount: number } | null> {
-    const response = await fetch(`${ENTERPRISE_API_BASE}/documents/extract-from-vault`, {
-      method: 'POST',
-      headers: { 'Content-Type': 'application/json' },
-      body: JSON.stringify({ bucket, path, mimeType, fileName, useOCR }),
-    });
+    const response = await fetch(`${ENTERPRISE_API_BASE}/documents/extract-from-vault`, {});
     const data = await response.json();
     return data.success ? data.data : null;

[Survived] LogicalOperator
src/lib/sovereignApi.ts:657:14
     try {
       const response = await fetch(`${ENTERPRISE_API_BASE}/documents/health`);
       const data = await response.json();
-      return data.available ?? false;
+      return data.available && false;
     } catch {
       return false;

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:657:32
     try {
       const response = await fetch(`${ENTERPRISE_API_BASE}/documents/health`);
       const data = await response.json();
-      return data.available ?? false;
+      return data.available ?? true;
     } catch {
       return false;

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:692:11
       const formData = new FormData();
       formData.append('file', file);
       formData.append('bucket', bucket);
-      if (metadata) {
+      if (true) {
         formData.append('metadata', JSON.stringify(metadata));
       }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:692:11
       const formData = new FormData();
       formData.append('file', file);
       formData.append('bucket', bucket);
-      if (metadata) {
+      if (false) {
         formData.append('metadata', JSON.stringify(metadata));
       }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:713:19
         size: file.size,
         mimeType: file.type,
         uploadedAt: new Date().toISOString(),
-        metadata: metadata || {},
+        metadata: false,
       };
     }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:713:19
         size: file.size,
         mimeType: file.type,
         uploadedAt: new Date().toISOString(),
-        metadata: metadata || {},
+        metadata: true,
       };
     }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:724:11
   async getDocument(bucket: string, path: string): Promise<Blob | null> {
     try {
       const response = await fetch(`${SOVEREIGN_API_BASE}/vault/download?bucket=${bucket}&path=${encodeURIComponent(path)}`);
-      if (response.ok) {
+      if (true) {
         return await response.blob();
       }

[Survived] ConditionalExpression
src/lib/sovereignApi.ts:724:11
   async getDocument(bucket: string, path: string): Promise<Blob | null> {
     try {
       const response = await fetch(`${SOVEREIGN_API_BASE}/vault/download?bucket=${bucket}&path=${encodeURIComponent(path)}`);
-      if (response.ok) {
+      if (false) {
         return await response.blob();
       }

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:751:74
    */
   async deleteDocument(bucket: string, path: string): Promise<boolean> {
     try {
-      const response = await fetch(`${SOVEREIGN_API_BASE}/vault/delete`, {
-        method: 'DELETE',
-        headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({ bucket, path }),
-      });
+      const response = await fetch(`${SOVEREIGN_API_BASE}/vault/delete`, {});
       const data = await response.json();
       return data.success ?? false;

[Survived] LogicalOperator
src/lib/sovereignApi.ts:757:14
         body: JSON.stringify({ bucket, path }),
       });
       const data = await response.json();
-      return data.success ?? false;
+      return data.success && false;
     } catch {
       return false;

[Survived] BooleanLiteral
src/lib/sovereignApi.ts:757:30
         body: JSON.stringify({ bucket, path }),
       });
       const data = await response.json();
-      return data.success ?? false;
+      return data.success ?? true;
     } catch {
       return false;

[Survived] ObjectLiteral
src/lib/sovereignApi.ts:781:29
 // SOVEREIGN STACK HEALTH
 // =============================================================================
 
-export const sovereignApi = {
-  /**
-   * Get health status of all sovereign services
-   */
-  async getHealthStatus(): Promise<SovereignHealthStatus> {
-    const response = await fetch(`${SOVEREIGN_API_BASE}/health`);
-    const data = await response.json();
-    return data;
-  },
-
-  // Re-export all service APIs
-  druid: druidApi,
-  storage: storageApi,
-  vector: vectorApi,
-  queue: queueApi,
-  metrics: metricsApi,
-  workflow: workflowApi,
-  featureFlags: featureFlagsApi,
-  enterprise: enterpriseApi,
-  vault: vaultApi,
-};
+export const sovereignApi = {};
 
 export default sovereignApi;
