[Survived] MethodExpression
src/lib/theme.ts:215:10
  * Merge theme classes with custom classes
  */
 export function cx(...classes: (string | undefined | null | false)[]): string {
-  return classes.filter(Boolean).join(' ');
+  return classes.join(' ');
 }
 

[Survived] ObjectLiteral
src/lib/theme.ts:229:15
  * Get severity color for UI elements
  */
 export function getSeverityClasses(severity: 'critical' | 'high' | 'medium' | 'low'): string {
-  const map = {
-    critical: 'bg-red-500/20 text-red-400 border-red-500/30',
-    high: 'bg-orange-500/20 text-orange-400 border-orange-500/30',
-    medium: 'bg-yellow-500/20 text-yellow-400 border-yellow-500/30',
-    low: 'bg-blue-500/20 text-blue-400 border-blue-500/30',
-  };
+  const map = {};
   return map[severity];
 }
